Function Reference

# Dialogs - Modern
| | | |
|---|---|---|
| AddButtonMode | AddChoice | AddListBoxTabStop |
| AddRadioMode | AdjustComponentPixelPos | AlignItemEdge |
| ClearGradientSliderSegments | CreateBorderlessBtn | CreateBorderlessMenu |
| CreateCenteredStaticText | CreateCheckBox | CreateCheckBox2 |
| CreateCheckBoxGroupBox | CreateClassPullDownMenu | CreateColorPopup |
| CreateControl | CreateCustomControl | CreateCustThumbPopup |
| CreateDataVisPDMenu | CreateDesignLayerPullDownMenu | CreateEditColorText |
| CreateEditInteger | CreateEditPassword | CreateEditReal |
| CreateEditText | CreateEditTextBox | CreateEnhancedPullDownMenu |
| CreateGradient | CreateGroupBox | CreateIconPushButton <sub>*obsolete in Vectorworks 2012*</sub>|
| CreateImageControl | CreateImageControl2 | CreateImagePushButton |
| CreateLayerPDMenu | CreateLayout | CreateLineAttributePopup |
| CreateLineStylePopup | CreateLineWeightPopup | CreateListBox |
| CreateListBoxN | CreateMarkerPopup | CreatePatternPopup |
| CreatePullDownMenu | CreatePullDownMenuGroupBox | CreatePullDownSearch |
| CreatePushButton | CreateRadioButton | CreateRadioButton2 |
| CreateRadioButtonGroupBox | CreateResizableLayout | CreateResourcePopup |
| CreateRightStaticText | CreateSearchEditBox | CreateSeparator |
| CreateSheetLayerPullDownMenu | CreateStandardIconControl | CreateStaticText |
| CreateStyledStatic | CreateSwapControl | CreateSwapPane |
| CreateSymbolDisplayControl | CreateSymDispCtrlN | CreateTabControl |
| CreateTabPane | CreateThreeStateCheckBox | CreateThumbnailPopup |
| CreateTreeControl | DeleteAllItems | DeregisterDialogFromTimerEvents |
| DeselectEditText | DisplaySwapPane | DisplayTabPane |
| EnableItem | EnableLBDropOnIndices | EnableTextEdit |
| ExpandTreeControlItem | GetActiveEditItem | GetActivePane |
| GetBooleanItem | GetChoiceCount | GetChoiceIndex |
| GetChoiceStringFromStoryBoundData | GetChoiceText | GetColorButton |
| GetColorChoice | GetComponentRect | GetComponentTextWidth |
| GetControlData | GetDlgCtrlWidthStdCh | GetEditInteger |
| GetEditReal | GetGradientSlider | GetGradientSliderData |
| GetGradientSliderSelectedMarker | GetIconPushButtonState | GetImagePopupObject |
| GetImagePopupObjectItemIndex | GetImagePopupSelectedItem | GetItemText |
| GetLayoutDialogPosition | GetLayoutDialogSize | GetLBHeaderTextWidth |
| GetLineAttributeData <sub>*obsolete in Vectorworks 2019*</sub>| GetLineStyleChoice <sub>*obsolete in Vectorworks 2019*</sub>| GetLineTypeAtIndex |
| GetLineTypeAttriData | GetLineTypeChoice | GetLineWeightChoice |
| GetMarkerChoice <sub>*obsolete in VectorWorks 2008*</sub>| GetMarkerPopupSelectedItem | GetMarkerValue |
| GetMultilineText | GetNumGradientSliderSegments | GetNumImagePopupItems |
| GetNumLineTypeItems | GetPatternData | GetPopUpChoiceIndex |
| GetSelectedChoiceIndex | GetSelectedChoiceInfo | GetSelectionRange |
| GetStoryBoundChoiceStrings | GetStoryBoundDataFromChoiceString | GetStoryChoiceStrsN |
| GetThreeStateCheckBoxState | GetTreeControlItemData | GetTreeControlItemText |
| GetTreeControlSelectedItem | GetTreeControlTextSelectedItem | InsertEnhancedPullDownMenuItem <sub>*obsolete in Vectorworks 2012*</sub>|
| InsertEnhanPullDownMenuItem | InsertGradientSliderSegment | InsertGradientSliSeg |
| InsertImagePopupObjectItem | InsertImagePopupResource | InsertImagePopupSeparator |
| InsertPropClassOrLayerItem | InsertProposedClassOrLayerItem <sub>*obsolete in Vectorworks 2012*</sub>| InsertTreeControlItem |
| IsClassChoiceSelected | IsItemEnabled | IsItemVisible |
| NotifyPullDownClicked | RefreshItem | RegisterDialogForTimerEvents |
| RemoveAllImagePopupItems | RemoveChoice | RemoveEnhancedPullDownMenuItemRange |
| RemoveGradientSliderSegment | RemoveImagePopupItem | RemoveListBoxTabStop |
| RemoveTreeControlItem | RunLayoutDialog | RunLayoutDialogN |
| RunNamedDialog | RunNamedDialogN | SelectChoice |
| SelectClassChoice | SelectEditText | SelectTreeControlItem |
| SetBelowItem | SetBooleanItem | SetColorButton |
| SetColorChoice | SetComponentIndeterminate | SetComponentSize |
| SetControlData | SetControlText | SetEdgeBinding |
| SetEditColorTextStyl | SetEditInteger | SetEditReal |
| SetFirstGroupItem | SetFirstLayoutItem | SetFocusOnItem |
| SetGradientSlider | SetGradientSliderData | SetGradientSliderSelectedMarker |
| SetHelpText | SetIconPushButtonState | SetImageControlHandle |
| SetImageControlPath | SetImagePopupSelectedItem | SetItemClickable |
| SetItemText | SetItemToolTipText | SetLayoutDialogPosition |
| SetLayoutDialogSize | SetLayoutOption | SetLBImageIndexes |
| SetLineAttributeData <sub>*obsolete in Vectorworks 2019*</sub>| SetLineStyleChoice <sub>*obsolete in Vectorworks 2019*</sub>| SetLineTypeAttriData |
| SetLineTypeChoice | SetLineWeightChoice | SetListBoxTabStops |
| SetMarkerChoice <sub>*obsolete in VectorWorks 2008*</sub>| SetMarkerValue | SetPatternData |
| SetProportionalBinding | SetRightItem | SetSelectionRange |
| SetSliderLiveUpdate | SetStaticTextColor | SetStaticTextColorN |
| SetStaticTextStyle | SetThreeStateCheckBoxState | SetTreeControlItemData |
| SetVSResourceFile | ShowByClassChoice | ShowEditTileDialog |
| ShowEditTileSettingsDialog | ShowEnhancedPullDownMenuGroupIcon | ShowItem |
| ShowNewTileDialog | UpdateImageControl2 | UpdateImageControl3 |
| UpdateImagePushButton | UpdateSymbolDisplayControl | UpdateSymDispCtrlN |
| VerifyLayout